import { colorsTuple, type MantineColorsTuple } from '@mantine/core';

/**
 * Палитра нейтральных черно-серых оттенков.
 *
 * Каждый элемент массива соответствует уровню насыщенности и используется для
 * текста, фонов, границ и других UI-элементов.
 *
 * | Индекс | Значение HEX | Применение                              |
 * |--------|------------- |-----------------------------------------|
 * | 0      | #F5F5F5     | Светлый фон, background                |
 * | 1      | #ECECEC     | Светлый фон для карточек и панелей     |
 * | 2      | #C8C8C8     | Лёгкие границы, hover                  |
 * | 3      | #AFAFAF     | Мягкий hover, secondary background     |
 * | 4      | #969696     | Акценты, disabled state                |
 * | 5      | #7D7D7D     | Текст второстепенный                   |
 * | 6      | #646464     | Тёмный текст, иконки                   |
 * | 7      | #4B4B4B     | Основной текст, бордеры                |
 * | 8      | #323232     | Тёмные элементы интерфейса             |
 * | 9      | #191919     | Глубокий тёмный фон, hover             |
 * | 10     | #000000     | Чистый чёрный, основной акцент         |
 *
 */
export const blackColorsPalette: MantineColorsTuple = [
  '#F5F5F5', // 9600 [0]
  '#ECECEC', // 9500 [1]
  '#C8C8C8', // 9000 [2]
  '#AFAFAF', // 8000 [3]
  '#969696', // 7000 [4]
  '#7D7D7D', // 6000 [5]
  '#646464', // 5000 [6]
  '#4B4B4B', // 4000 [7]
  '#323232', // 3000 [8]
  '#191919', // 2000 [9]
  '#000000', // 1000 [10]
] as const;

/* Белый цвет используется в основном для фона */
export const whiteColor = colorsTuple('#ffffff');
